# EditedBy Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..EditedBy Property
ParameterTypeId Class See Also
---
"Edited by"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId EditedBy { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EditedBy As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ EditedBy {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace